sdaiGetAggrElementBoundByItr(Sdai_ItrId*)
\details
Retrieves the aggregate element bound from a specified iterator.
\param iterator [in] An iterator to get the element bound from.
\returns An SDAI integer value that represents the element bound.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiVA_NSET - Value not set.
* sdaiVT_NVLD - Value type invalid.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.